# Quantrack Python crash course 9.

Notebooks of exercises on *Pandas* and *NumPy* .

In [4]:
import pandas as pd
import numpy as np

### Reminder :

* Pandas is a Python package providing fast, flexible, and expressive data structures designed to make working with 'relational' or 'labeled' data both easy and intuitive. It aims to be the fundamental high-level building block for doing practical, real world data analysis in Python.    


* NumPy is a Python package providing fast, flexible, and expressive data structures designed to make working with 'relationa' or 'labeled' data both easy and intuitive. It aims to be the fundamental high-level building block for doing practical, real world data analysis in Python

#### Data-loading - House pricing datasets

We change column names.

In [132]:
import os 

print(os.getcwd())
print()

print('This is our current working directory')

/Users/Cesar/Desktop/quantrack/qt_internal_training/python_course_beginners/data-sets

This is our current working directory

In [149]:
#command to change the directory
os.chdir('/Users/Cesar/Desktop/quantrack/qt_internal_training/python_course_beginners/data-sets')
print(os.getcwd())

/Users/Cesar/Desktop/quantrack/qt_internal_training/python_course_beginners/data-sets

In [150]:
dfp = pd.read_excel('house_price.xlsx')

#let's create a new list to change the name of the columns, and make it a bit more user-friendly
new_columns = [
            'transaction_date',
            'house_age',
            'distance_metro',
            'number_stores',
            'lat',
            'long',
            'area_price_unit']

#let's change the columns :
dfp.columns = new_columns

In [135]:
dfp.head(5)

,transaction_date,house_age,distance_metro,number_stores,lat,long,area_price_unit
0,2012.916667,32.0,84.87882,10,24.98298,121.54024,37.9
1,2012.916667,19.5,306.59470,9,24.98034,121.53951,42.2
2,2013.583333,13.3,561.98450,5,24.98746,121.54391,47.3
3,2013.500000,13.3,561.98450,5,24.98746,121.54391,54.8
4,2012.833333,5.0,390.56840,5,24.97937,121.54245,43.1

Pandas is well suited for many different kinds of data:

* Tabular data with heterogeneously-typed columns, as in an SQL table or Excel spreadsheet
* Ordered and unordered (not necessarily fixed-frequency) time series data.
* Arbitrary matrix data with row and column labels
* Any other form of observational / statistical data sets.

#### Note :

Some exercises do not require to use our dfp price dataset.

### 1. Pandas Series 
### 2. Pandas DataFrames
### 3. A little bit of maths

First two parts are pretty easy, the last one is a bit harder with exercises tackling some topics we have been studying so far. You will probably face some errors. Please try and debug your code yourself as much as possible.
Try to write as clean as possible code.

## 1. Pandas Series

### a. Write a Python function to convert a Panda module Series to Python list and it's type.

* Use return statement
* <span style="color:green">Use dfp data--set</span>

### b. Write a Python function to convert a dictionary to a Pandas series.

* Check out nb.6 on dictionaries
* Apply same methods as exercises a.

### c. Write a Python Pandas program to convert the first column of a DataFrame as a Series. 

* <span style="color:green">Use dfp data--set</span>

### Solutions

### a. Function to convert series to list

When do you deal with function-related exercises, you have to identify 

1. Your input
2. The set of actions you want to apply on your input
3. Your output

In [115]:
#Let's extract area_price_unit Series for our exercises :

area_series = df.area_price_unit
print(type(area_series))
print('')
print('use df.column_name if you want to extract corresponding pandas Series')

<class 'pandas.core.series.Series'>

use df.column_name if you want to extract corresponding pandas Series

In [116]:
def series_to_list(myseries):
    #Python lets you apply list built.in function directly on your series 
    mylist = list(myseries)
    #use print to verify conversion is effective
    print((type(mylist)))
    #use return statement
    return mylist

In [117]:
#test
area_list = series_to_list(area_series)

<class 'list'>

### b. Convert a dictionary to a Pandas series.

In [118]:
#Create your dictionaries using key-values pairs

dict_ =  {'a': 100, 
          'b': 200, 
          'c': 300, 
          'd': 400, 
          'e': 800}

In [119]:
def dict_to_series(mydict):
    #Pandas lets you apply pd.Series function directly on your dict
    mySeries = pd.Series(mydict)
    #use print to verify conversion is effective
    print(type(mySeries))
    #use return statement
    return mySeries

In [120]:
#test
mySeries = dict_to_series(dict_)

<class 'pandas.core.series.Series'>

### c.  Convert the first column of a DataFrame as a Series

Steps :

1. Extract first column of dfp using df slicing
2. Apply same methods as previous exercises

In [121]:
#Get first column using naive methods
dfp.columns

Index(['transaction_date', 'house_age', 'distance_metro', 'number_stores',
       'lat', 'long', 'area_price_unit'],
      dtype='object')

In [122]:
#Syntax to select just one column

#as a Series
dfp_first_column_as_series = df['transaction_date']
print(type(dfp_first_column_as_series))

#as a Series - Method 2
dfp_first_column_as_series_bis = df.transaction_date
print(type(dfp_first_column_as_series_bis))

#as a Series - Method 3
#select all lines and first columns
dfp_first_column_as_series_ter = df.iloc[:,0]
print(type(dfp_first_column_as_series_ter))

#as a DataFrame - we use double []
dfp_first_column_as_df = df[['transaction_date']]
print(type(dfp_first_column_as_df))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [123]:
#Convert it to a function using one of the four methods :

def firstcol_to_series(df):
    #We use method 3 - Why ?
    mySeries = df.iloc[:,0]
    #We verify conversion 
    print(type(mySeries))
    #use return statement
    return mySeries

In [124]:
#test 
firstcol_to_series(dfp)

<class 'pandas.core.series.Series'>

0      2012.916667
1      2012.916667
2      2013.583333
3      2013.500000
4      2012.833333
          ...
409    2013.000000
410    2012.666667
411    2013.250000
412    2013.000000
413    2013.500000
Name: transaction_date, Length: 414, dtype: float64

#### Note :

We used method 3 becuase it is the only one we can apply on **any data-set**.  
Other methods use column name and thus can't be applied on another data-set.

## 2. Pandas DataFrames

### a. Write a Pandas program to convert dfp transaction_date column values into actual datetime objects.

* <span style="color:green">Use dfp data--set</span>
* Should we use datetime package ?

### b. Write a Pandas program to create and display a DataFrame from a specified dictionary - Create a separate list and use it as an index

* Be careful of index length
* use - index =  - options in pd.DataFrame command.
* **BONUS** : Introduce NaN values into your dictionary and dropit using dropna pandas command

### c. Write a Pandas program -not a function- to select the 'lat' and 'long' columns from dfp DataFrame - Output should be DataFrame.

* <span style="color:green">Use dfp data--set</span>
* Use one of 1.c conversion methods

### d. Write a Pandas program to delete DataFrame row(s) based on given column value

* <span style="color:green">Use dfp data--set</span>
* Use drop Pandas methos

### a. Datetime Conversion

Note that the only variable is the year, how can we change it so only keep the date ?
Let's use lambda function

Let's use pd.series.apply pandas functions.
We would like to keep the last 4 characters of our transaction_date column.  
Let's define a function getting last four characters of a string.

#### Note :

Objects types are float64, we need to convert them to string

In [153]:
dfp.transaction_date

0      2012.916667
1      2012.916667
2      2013.583333
3      2013.500000
4      2012.833333
          ...
409    2013.000000
410    2012.666667
411    2013.250000
412    2013.000000
413    2013.500000
Name: transaction_date, Length: 414, dtype: float64

In [156]:
def float64_to_string(myfloat):
    return str(myfloat)

In [161]:
#define your help function
def get_first_four(your_string):
    result = your_string[:4]
    return result

In [162]:
#apply your conversion function on your series
dfp.transaction_date = dfp.transaction_date.apply(float64_to_string)
print(dfp.transaction_date)
print('dtype has changed')

0      2012.9166667
1      2012.9166667
2      2013.5833333
3            2013.5
4      2012.8333333
           ...
409          2013.0
410    2012.6666667
411         2013.25
412          2013.0
413          2013.5
Name: transaction_date, Length: 414, dtype: object
dtype has changed

In [163]:
#lets extract last four characters
dfp.transaction_date = dfp.transaction_date.apply(get_first_four)
dfp.transaction_date

0      2012
1      2012
2      2013
3      2013
4      2012
       ...
409    2013
410    2012
411    2013
412    2013
413    2013
Name: transaction_date, Length: 414, dtype: object

In [164]:
dfp.head(5)

,transaction_date,house_age,distance_metro,number_stores,lat,long,area_price_unit
0,2012,32.0,84.87882,10,24.98298,121.54024,37.9
1,2012,19.5,306.59470,9,24.98034,121.53951,42.2
2,2013,13.3,561.98450,5,24.98746,121.54391,47.3
3,2013,13.3,561.98450,5,24.98746,121.54391,54.8
4,2012,5.0,390.56840,5,24.97937,121.54245,43.1

### b. Dict to df

In [189]:
#dict creation

dict_students  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

print(len(dict_students))

#let's check length using name key
print(len(dict_students['name']))

#let's create our 6-length index
index = list(range(1,11))

4
10

It's important index matchs dict length

In [190]:
index

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

Note that we can pass many types of date as an argument intp pd.DataFrame() function.

In [182]:
#simple application
df = pd.DataFrame(dict_students, index = index)
df

         name  score  attempts qualify
1   Anastasia   12.5         1     yes
2        Dima    9.0         3      no
3   Katherine   16.5         2     yes
4       James    NaN         3      no
5       Emily    9.0         2      no
6     Michael   20.0         3     yes
7     Matthew   14.5         1     yes
8       Laura    NaN         1      no
9       Kevin    8.0         2      no
10      Jonas   19.0         1     yes

In [192]:
#let's drop NaN containing lines
df_without_NaN = df.dropna(how='any')
df_without_NaN

         name  score  attempts qualify
1   Anastasia   12.5         1     yes
2        Dima    9.0         3      no
3   Katherine   16.5         2     yes
5       Emily    9.0         2      no
6     Michael   20.0         3     yes
7     Matthew   14.5         1     yes
9       Kevin    8.0         2      no
10      Jonas   19.0         1     yes

### c. Write a Pandas program -not a function- to select the 'lat' and 'long' columns from dfp DataFrame - Output should be DataFrame.

In [200]:
#let's use pandas syntax 
df_lat_long = dfp[['lat','long']]
df_lat_long

          lat       long
0    24.98298  121.54024
1    24.98034  121.53951
2    24.98746  121.54391
3    24.98746  121.54391
4    24.97937  121.54245
..        ...        ...
409  24.94155  121.50381
410  24.97433  121.54310
411  24.97923  121.53986
412  24.96674  121.54067
413  24.97433  121.54310

[414 rows x 2 columns]

We need to use [ [ ] ] to define a dataframe

In [201]:
type(df_lat_long)

pandas.core.frame.DataFrame

### d. Delete rows

In [202]:
dfp.head(5)

,transaction_date,house_age,distance_metro,number_stores,lat,long,area_price_unit
0,2012,32.0,84.87882,10,24.98298,121.54024,37.9
1,2012,19.5,306.59470,9,24.98034,121.53951,42.2
2,2013,13.3,561.98450,5,24.98746,121.54391,47.3
3,2013,13.3,561.98450,5,24.98746,121.54391,54.8
4,2012,5.0,390.56840,5,24.97937,121.54245,43.1

Let's delete rows with house_age > 15 years

In [204]:
#Pandas allows you easily select lines based on some conditions
df_15_years = dfp[dfp.house_age > 15]
df_15_years

,transaction_date,house_age,distance_metro,number_stores,lat,long,area_price_unit
0,2012,32.0,84.87882,10,24.98298,121.54024,37.9
1,2012,19.5,306.59470,9,24.98034,121.53951,42.2
6,2012,34.5,623.47310,7,24.97933,121.53642,40.3
7,2013,20.3,287.60250,6,24.98042,121.54228,46.7
8,2013,31.7,5512.03800,1,24.95095,121.48458,18.8
...,...,...,...,...,...,...,...
403,2012,30.9,161.94200,9,24.98353,121.53966,39.7
404,2013,16.4,289.32480,5,24.98203,121.54348,41.2
405,2012,23.0,130.99450,6,24.95663,121.53765,37.2
408,2013,18.5,2175.74400,3,24.96330,121.51243,28.1
411,2013,18.8,390.96960,7,24.97923,121.53986,40.6

Let's delete rows with distance_metro > 500

In [206]:
df_dst_500 = dfp[dfp.distance_metro > 500]
df_dst_500

,transaction_date,house_age,distance_metro,number_stores,lat,long,area_price_unit
2,2013,13.3,561.9845,5,24.98746,121.54391,47.3
3,2013,13.3,561.9845,5,24.98746,121.54391,54.8
5,2012,7.1,2175.0300,3,24.96305,121.51254,32.1
6,2012,34.5,623.4731,7,24.97933,121.53642,40.3
8,2013,31.7,5512.0380,1,24.95095,121.48458,18.8
...,...,...,...,...,...,...,...
398,2013,14.7,1717.1930,2,24.96447,121.51649,23.0
401,2013,7.6,2175.0300,3,24.96305,121.51254,27.7
407,2013,5.2,2408.9930,0,24.95505,121.55964,22.3
408,2013,18.5,2175.7440,3,24.96330,121.51243,28.1
409,2013,13.7,4082.0150,0,24.94155,121.50381,15.4